MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAM4LS2BA/mcu.h
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;

  /* Cortex-M handlers */
  void* pfnReset_Handler;
  void* pfnNMI_Handler;
  void* pfnHardFault_Handler;
  void* pfnMemManage_Handler;
  void* pfnBusFault_Handler;
  void* pfnUsageFault_Handler;
  void* pvReservedM9;
  void* pvReservedM8;
  void* pvReservedM7;
  void* pvReservedM6;
  void* pfnSVC_Handler;
  void* pfnDebugMon_Handler;
  void* pvReservedM3;
  void* pfnPendSV_Handler;
  void* pfnSysTick_Handler;

  /* Peripheral handlers */
  void* pfnHFLASHC_Handler;               /*  0 Flash Controller */
  void* pfnPDCA_0_Handler;                /*  1 Peripheral DMA Controller IRQ 0 */
  void* pfnPDCA_1_Handler;                /*  2 Peripheral DMA Controller IRQ 1 */
  void* pfnPDCA_2_Handler;                /*  3 Peripheral DMA Controller IRQ 2 */
  void* pfnPDCA_3_Handler;                /*  4 Peripheral DMA Controller IRQ 3 */
  void* pfnPDCA_4_Handler;                /*  5 Peripheral DMA Controller IRQ 4 */
  void* pfnPDCA_5_Handler;                /*  6 Peripheral DMA Controller IRQ 5 */
  void* pfnPDCA_6_Handler;                /*  7 Peripheral DMA Controller IRQ 6 */
  void* pfnPDCA_7_Handler;                /*  8 Peripheral DMA Controller IRQ 7 */
  void* pfnPDCA_8_Handler;                /*  9 Peripheral DMA Controller IRQ 8 */
  void* pfnPDCA_9_Handler;                /* 10 Peripheral DMA Controller IRQ 9 */
  void* pfnPDCA_10_Handler;               /* 11 Peripheral DMA Controller IRQ 10 */
  void* pfnPDCA_11_Handler;               /* 12 Peripheral DMA Controller IRQ 11 */
  void* pfnPDCA_12_Handler;               /* 13 Peripheral DMA Controller IRQ 12 */
  void* pfnPDCA_13_Handler;               /* 14 Peripheral DMA Controller IRQ 13 */
  void* pfnPDCA_14_Handler;               /* 15 Peripheral DMA Controller IRQ 14 */
  void* pfnPDCA_15_Handler;               /* 16 Peripheral DMA Controller IRQ 15 */
  void* pfnCRCCU_Handler;                 /* 17 CRC Calculation Unit */
  void* pfnUSBC_Handler;                  /* 18 USB 2.0 Interface */
  void* pfnPEVC_0_Handler;                /* 19 Peripheral Event Controller IRQ 0 */
  void* pfnPEVC_1_Handler;                /* 20 Peripheral Event Controller IRQ 1 */
  void* pvReserved21;
  void* pfnPM_Handler;                    /* 22 Power Manager */
  void* pfnSCIF_Handler;                  /* 23 System Control Interface */
  void* pfnFREQM_Handler;                 /* 24 Frequency Meter */
  void* pfnGPIO_0_Handler;                /* 25 General-Purpose Input/Output Controller IRQ 0 */
  void* pfnGPIO_1_Handler;                /* 26 General-Purpose Input/Output Controller IRQ 1 */
  void* pfnGPIO_2_Handler;                /* 27 General-Purpose Input/Output Controller IRQ 2 */
  void* pfnGPIO_3_Handler;                /* 28 General-Purpose Input/Output Controller IRQ 3 */
  void* pfnGPIO_4_Handler;                /* 29 General-Purpose Input/Output Controller IRQ 4 */
  void* pfnGPIO_5_Handler;                /* 30 General-Purpose Input/Output Controller IRQ 5 */
  void* pfnGPIO_6_Handler;                /* 31 General-Purpose Input/Output Controller IRQ 6 */
  void* pfnGPIO_7_Handler;                /* 32 General-Purpose Input/Output Controller IRQ 7 */
  void* pfnGPIO_8_Handler;                /* 33 General-Purpose Input/Output Controller IRQ 8 */
  void* pfnGPIO_9_Handler;                /* 34 General-Purpose Input/Output Controller IRQ 9 */
  void* pfnGPIO_10_Handler;               /* 35 General-Purpose Input/Output Controller IRQ 10 */
  void* pfnGPIO_11_Handler;               /* 36 General-Purpose Input/Output Controller IRQ 11 */
  void* pfnBPM_Handler;                   /* 37 Backup Power Manager */
  void* pfnBSCIF_Handler;                 /* 38 Backup System Control Interface */
  void* pfnAST_0_Handler;                 /* 39 Asynchronous Timer IRQ 0 */
  void* pfnAST_1_Handler;                 /* 40 Asynchronous Timer IRQ 1 */
  void* pfnAST_2_Handler;                 /* 41 Asynchronous Timer IRQ 2 */
  void* pfnAST_3_Handler;                 /* 42 Asynchronous Timer IRQ 3 */
  void* pfnAST_4_Handler;                 /* 43 Asynchronous Timer IRQ 4 */
  void* pfnWDT_Handler;                   /* 44 Watchdog Timer */
  void* pfnEIC_0_Handler;                 /* 45 External Interrupt Controller IRQ 0 */
  void* pfnEIC_1_Handler;                 /* 46 External Interrupt Controller IRQ 1 */
  void* pfnEIC_2_Handler;                 /* 47 External Interrupt Controller IRQ 2 */
  void* pfnEIC_3_Handler;                 /* 48 External Interrupt Controller IRQ 3 */
  void* pfnEIC_4_Handler;                 /* 49 External Interrupt Controller IRQ 4 */
  void* pfnEIC_5_Handler;                 /* 50 External Interrupt Controller IRQ 5 */
  void* pfnEIC_6_Handler;                 /* 51 External Interrupt Controller IRQ 6 */
  void* pfnEIC_7_Handler;                 /* 52 External Interrupt Controller IRQ 7 */
  void* pfnIISC_Handler;                  /* 53 Inter-IC Sound (I2S) Controller */
  void* pfnSPI_Handler;                   /* 54 Serial Peripheral Interface */
  void* pfnTC0_0_Handler;                 /* 55 Timer/Counter 0 IRQ 0 */
  void* pfnTC0_1_Handler;                 /* 56 Timer/Counter 0 IRQ 1 */
  void* pfnTC0_2_Handler;                 /* 57 Timer/Counter 0 IRQ 2 */
  void* pfnTC1_0_Handler;                 /* 58 Timer/Counter 1 IRQ 0 */
  void* pfnTC1_1_Handler;                 /* 59 Timer/Counter 1 IRQ 1 */
  void* pfnTC1_2_Handler;                 /* 60 Timer/Counter 1 IRQ 2 */
  void* pfnTWIM0_Handler;                 /* 61 Two-wire Master Interface 0 */
  void* pfnTWIS0_Handler;                 /* 62 Two-wire Slave Interface 0 */
  void* pfnTWIM1_Handler;                 /* 63 Two-wire Master Interface 1 */
  void* pfnTWIS1_Handler;                 /* 64 Two-wire Slave Interface 1 */
  void* pfnUSART0_Handler;                /* 65 Universal Synchronous Asynchronous Receiver Transmitter 0 */
  void* pfnUSART1_Handler;                /* 66 Universal Synchronous Asynchronous Receiver Transmitter 1 */
  void* pfnUSART2_Handler;                /* 67 Universal Synchronous Asynchronous Receiver Transmitter 2 */
  void* pfnUSART3_Handler;                /* 68 Universal Synchronous Asynchronous Receiver Transmitter 3 */
  void* pfnADCIFE_Handler;                /* 69 ADC controller interface */
  void* pfnDACC_Handler;                  /* 70 DAC Controller */
  void* pfnACIFC_Handler;                 /* 71 Analog Comparator Interface */
  void* pfnABDACB_Handler;                /* 72 Audio Bitstream DAC */
  void* pfnTRNG_Handler;                  /* 73 True Random Number Generator */
  void* pfnPARC_Handler;                  /* 74 Parallel Capture */
  void* pfnCATB_Handler;                  /* 75 Capacitive Touch Module B */
  void* pvReserved76;
  void* pfnTWIM2_Handler;                 /* 77 Two-wire Master Interface 2 */
  void* pfnTWIM3_Handler;                 /* 78 Two-wire Master Interface 3 */
  void* pvReserved79;
} DeviceVectors;

/* Cortex-M4 processor handlers */
void Reset_Handler               ( void );
void NMI_Handler                 ( void );
void HardFault_Handler           ( void );
void MemManage_Handler           ( void );
void BusFault_Handler            ( void );
void UsageFault_Handler          ( void );
void SVC_Handler                 ( void );
void DebugMon_Handler            ( void );
void PendSV_Handler              ( void );
void SysTick_Handler             ( void );

/* Peripherals handlers */
void HFLASHC_Handler             ( void );
void PDCA_0_Handler              ( void );
void PDCA_1_Handler              ( void );
void PDCA_2_Handler              ( void );
void PDCA_3_Handler              ( void );
void PDCA_4_Handler              ( void );
void PDCA_5_Handler              ( void );
void PDCA_6_Handler              ( void );
void PDCA_7_Handler              ( void );
void PDCA_8_Handler              ( void );
void PDCA_9_Handler              ( void );
void PDCA_10_Handler             ( void );
void PDCA_11_Handler             ( void );
void PDCA_12_Handler             ( void );
void PDCA_13_Handler             ( void );
void PDCA_14_Handler             ( void );
void PDCA_15_Handler             ( void );
void CRCCU_Handler               ( void );
void USBC_Handler                ( void );
void PEVC_0_Handler              ( void );
void PEVC_1_Handler              ( void );
void PM_Handler                  ( void );
void SCIF_Handler                ( void );
void FREQM_Handler               ( void );
void GPIO_0_Handler              ( void );
void GPIO_1_Handler              ( void );
void GPIO_2_Handler              ( void );
void GPIO_3_Handler              ( void );
void GPIO_4_Handler              ( void );
void GPIO_5_Handler              ( void );
void GPIO_6_Handler              ( void );
void GPIO_7_Handler              ( void );
void GPIO_8_Handler              ( void );
void GPIO_9_Handler              ( void );
void GPIO_10_Handler             ( void );
void GPIO_11_Handler             ( void );
void BPM_Handler                 ( void );
void BSCIF_Handler               ( void );
void AST_0_Handler               ( void );
void AST_1_Handler               ( void );
void AST_2_Handler               ( void );
void AST_3_Handler               ( void );
void AST_4_Handler               ( void );
void WDT_Handler                 ( void );
void EIC_0_Handler               ( void );
void EIC_1_Handler               ( void );
void EIC_2_Handler               ( void );
void EIC_3_Handler               ( void );
void EIC_4_Handler               ( void );
void EIC_5_Handler               ( void );
void EIC_6_Handler               ( void );
void EIC_7_Handler               ( void );
void IISC_Handler                ( void );
void SPI_Handler                 ( void );
void TC0_0_Handler               ( void );
void TC0_1_Handler               ( void );
void TC0_2_Handler               ( void );
void TC1_0_Handler               ( void );
void TC1_1_Handler               ( void );
void TC1_2_Handler               ( void );
void TWIM0_Handler               ( void );
void TWIS0_Handler               ( void );
void TWIM1_Handler               ( void );
void TWIS1_Handler               ( void );
void USART0_Handler              ( void );
void USART1_Handler              ( void );
void USART2_Handler              ( void );
void USART3_Handler              ( void );
void ADCIFE_Handler              ( void );
void DACC_Handler                ( void );
void ACIFC_Handler               ( void );
void ABDACB_Handler              ( void );
void TRNG_Handler                ( void );
void PARC_Handler                ( void );
void CATB_Handler                ( void );
void TWIM2_Handler               ( void );
void TWIM3_Handler               ( void );

